#ifndef RESOUSE_H
#define RESOUSE_H
#include <string>
using namespace std;
typedef struct relation
{   string name;
    string rela[10];
    }RELATION;
//STRUCT ku
RELATION ku[100]={{"aa",{"曾祖父","曾祖母","呃，怎么叫随你","奶奶","爸爸/伯伯/叔叔","姑妈","伯祖父","伯祖父","祖姑母""祖姑母"}},
                  {"ab",{"曾外祖父","曾外祖母","祖父","呃，怎么叫随你","爸爸/伯伯/叔叔","姑妈","舅公","舅公","祖姨母","祖姨母"}},
                  {"ac",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"ad",{"外公","外婆","爸爸","哈哈","大舅","小舅","自己/哥哥/弟弟","自己/姐姐/妹妹","大姨","姨妈"}},
                  {"ae",{"父亲","母亲","哥哥","弟弟","妹妹","姐姐","儿子","女儿","丈夫","妻子"}},
                  {"af",{"父亲","母亲","哥哥","弟弟","妹妹","姐姐","儿子","女儿","丈夫","妻子"}},
                  {"ag",{"爷爷","奶奶","呃，怎么叫随你","伯母","哥哥/弟弟","姐姐/妹妹","伯伯","叔叔","姑妈","姑姐"}},
                  {"ah",{"爷爷","奶奶","呃，怎么叫随你","婶婶","哥哥/弟弟","姐姐/妹妹","伯伯","叔叔","姑妈","姑姐"}},
                  {"ai",{"祖父","祖母","姑丈","呃，怎么叫随你","哥哥/弟弟","姐姐/妹妹","伯伯","爸爸/叔叔","姑母","姑母"}},
                  {"aj",{"祖父","祖母","姑丈","呃，怎么叫随你","哥哥/弟弟","姐姐/妹妹","爸爸/叔叔/伯伯","叔叔","姑母""姑母"}},

                  {"ba",{"曾外祖父","曾外祖母","呃，怎么叫随你","外婆","舅舅","妈妈/姨妈","伯外祖父","叔外祖父","姑外祖母","姑外祖母"}},
                  {"bb",{"外曾外祖父","外曾外祖母","外公","呃，怎么叫随你","舅舅","妈妈/姨妈","外舅公","外舅公","姨外祖母","姨外祖母"}},
                  {"bc",{"爷爷","奶奶","呃，怎么叫随你","妈妈","/自己哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑妈"}},
                  {"bd",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"be",{"爸爸","妈妈","呃，怎么叫随你","妻子/嫂子/弟妹","儿子","女儿","哥哥","弟弟","姐姐","妹妹"}},
                  {"bf",{"爸爸","妈妈","丈夫/姐夫","呃，怎么叫随你","儿子","女儿","哥哥","弟弟","姐姐","妹妹"}},
                  {"bg",{"外公","外婆","哈哈","大舅妈","舅表哥/舅表弟","舅表姐/舅表妹","舅舅","舅舅","姨妈","妈妈/姨妈"}},
                  {"bh",{"外公","外婆","哈哈","大舅妈","舅表哥/舅表弟","舅表姐/舅表妹","舅舅","舅舅","姨妈","妈妈/姨妈"}},
                  {"bi",{"外公","外婆","大姨夫","哈哈","姨表哥/表弟","姨表哥/表弟","舅舅","舅舅","姨妈","妈妈/姨妈"}},
                  {"bj",{"外公","外婆","大姨夫","哈哈","姨表哥/表弟","姨表哥/表弟","舅舅","舅舅","姨妈","妈妈/姨妈"}},

                  {"ca",{"祖翁","祖婆","呃，怎么叫随你","外婆","小叔子/老公/大伯子","小姑子/大姑子","伯翁","叔父","姑婆","姑婆"}},
                  {"cb",{"外公","外婆","公公","呃，怎么叫随你","小叔子/老公/大伯子","小姑子/大姑子","舅公","舅公","姨婆","姨婆"}},
                  {"cc",{"是你就最好","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"cd",{"爸爸","妈妈","丈夫","呃，怎么叫随你","儿子","女儿","哥哥","弟弟","姐姐","妹妹"}},
                  {"ce",{"相公","自己/妻子","暂时还不支持这个功能","儿媳妇","孙子","孙女","儿子","儿子","女儿","女儿"}},
                  {"cf",{"自己/丈夫","自己/妻子","女婿","暂时还不支持这个功能","外孙子","外孙女","儿子","儿子","女儿","女儿"}},
                  {"cg",{"公公","婆婆","呃，怎么叫随你","大婶子","婆家侄","侄女","小叔子/老公/大伯子","小叔子/老公/大伯子","大姑子","小姑子"}},
                  {"ch",{"公公","婆婆","呃，怎么叫随你","大婶子","婆家侄","侄女","小叔子/老公/大伯子","小叔子/老公/大伯子","大姑子","小姑子"}},
                  {"ci",{"公公","婆婆","大姑父","呃，怎么叫随你","外甥","外甥女","大伯子","小叔子","大姑子","小姑子"}},
                  {"cj",{"公公","婆婆","大姑父","呃，怎么叫随你","外甥","外甥女","大伯子","小叔子","大姑子","小姑子"}},

                  {"da",{"太岳父","太岳母","呃，怎么叫随你","岳母","小舅子/大舅子","小姨子/大姨子","伯岳","叔岳","姑岳母","姑岳母"}},
                  {"db",{"外太岳父","外太岳母","岳父","呃，怎么叫随你","小舅子/大舅子","小姨子/大姨子","舅岳父","舅岳父","姨岳母","姨岳母"}},
                  {"dc",{"自己","妻子","呃，怎么叫随你","儿媳妇","孙子","孙女","儿子","儿子","女儿","女儿"}},
                  {"dd",{"是你就好","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"de",{"自己","妻子","呃，怎么叫随你","儿媳妇","孙子","孙女","儿子","儿子","女儿","女儿"}},
                  {"df",{"自己","妻子","女婿","暂时还不支持这个功能","外孙子","外孙女","儿子","儿子","女儿","女儿"}},
                  {"dg",{"岳父","岳母","哈哈","舅嫂","内侄","内侄女","大舅哥","小舅子","小姨子","小姨子"}},
                  {"dh",{"岳父","岳母","哈哈","舅嫂","内侄","内侄女","大舅哥","小舅子","小姨子","小姨子"}},
                  {"di",{"岳父","岳母","大姨夫","哈哈","内甥","内甥女","大舅子","小舅子","小姨子","小姨子"}},
                  {"dj",{"岳父","岳母","大姨夫","哈哈","内甥","内甥女","大舅子","小舅子","小姨子","小姨子"}},

                  {"ea",{"爸爸","妈妈","哈哈","自己","儿子","女儿","哥哥","弟弟","姐姐","妹妹"}},
                  {"eb",{"爸爸/岳父","妈妈/岳母","自己","哈哈","儿子","女儿","哥哥/大舅子","弟弟/小舅子","姐姐/大姨子","妹妹/小姨子"}},
                  {"ed",{"亲家公","亲家母","儿子","哈哈","孙子","孙女","姻侄","姻侄","姻侄女","姻侄女"}},
                  {"ec",{"是你就好","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"ee",{"儿子","儿媳妇","呃，怎么叫随你","孙媳妇","曾孙子","曾孙女","孙子","孙子","孙女","孙女"}},
                  {"ef",{"儿子","儿媳妇","孙女婿","哈哈","曾外孙","曾外孙女","孙子","孙子","孙女","孙女"}},
                  {"eg",{"自己","自己","呃，怎么叫随你","媳妇","孙子","孙子","儿女","儿子","女儿","女儿"}},
                  {"eh",{"自己","自己","呃，怎么叫随你","媳妇","孙子","孙子","儿女","儿子","女儿","女儿"}},
                  {"ei",{"自己","自己/老婆","女婿","呃，怎么叫随你","孙子","孙女","儿子","儿子","女儿","女儿"}},
                  {"ej",{"自己","自己/老婆","女婿","呃，怎么叫随你","孙子","孙女","儿子","儿子","女儿","女儿"}},

                  {"fa",{"爸爸/公公","妈妈/婆婆","哈哈","自己","儿子","女儿","哥哥/大伯子","弟弟/小叔子","姐姐/大姑子","妹妹/小姑子"}},
                  {"fb",{"爸爸/岳父","妈妈/岳母","自己","哈哈","儿子","女儿","哥哥/大舅子","弟弟/小舅子","姐姐/大姨子","妹妹/小姨子"}},
                  {"fc",{"亲家公","亲家母","你决定","女儿","外孙","外孙女","儿子","儿子","女儿","女儿"}},
                  {"fd",{"你决定","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"fe",{"女婿","女儿","呃，怎么叫随你","外孙媳","外曾孙","外曾孙女","孙外","外孙","外孙女","外孙女"}},
                  {"ff",{"女婿","女儿","外孙女婿","呃，怎么叫随你","外曾外孙","外曾外孙女","孙外","外孙","外孙女","外孙女"}},
                  {"fg",{"儿子","儿子","呃，怎么叫随你","儿媳妇","孙子","孙子","儿女","儿子","女儿","女儿"}},
                  {"fh",{"儿子","儿子","女婿","呃，怎么叫随你","孙子","孙子","儿女","儿子","女儿","女儿"}},
                  {"fi",{"自己","自己/老婆","女婿","呃，怎么叫随你","外孙","外孙女","儿子","儿子","女儿","女儿"}},
                  {"fj",{"自己","自己/老婆","女婿","呃，怎么叫随你","外孙","外孙女","儿子","儿子","女儿","女儿"}},

                  {"ga",{"爷爷","奶奶","呃，怎么叫随你","妈妈","自己/哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑妈"}},
                  {"gb",{"外公","外婆","妈妈","哈哈","自己/哥哥/弟弟","自己/姐姐/妹妹","大舅","小舅","大姨","姨妈"}},
                  {"gc",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"gd",{"姻伯父","姻伯母","哥哥","你开心就好","侄子","侄女","姻兄","姻弟","姻姐","姻妹"}},
                  {"ge",{"哥哥","嫂子","你开心就好","侄媳","侄孙","侄孙女","侄子","侄子","侄女","侄女"}},
                  {"gf",{"哥哥","嫂子","侄女婿","你开心就好","侄孙","侄孙女","侄子","侄子","侄女","侄女"}},
                  {"gg",{"爸爸","妈妈","呃，怎么叫随你","嫂子","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"gh",{"爸爸","妈妈","呃，怎么叫随你","弟妹","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},
                  {"gi",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"gj",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},

                  {"ha",{"爷爷","奶奶","呃，怎么叫随你","妈妈","自己/哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑妈"}},
                  {"hb",{"外公","外婆","妈妈","哈哈","自己/哥哥/弟弟","自己/姐姐/妹妹","大舅","小舅","大姨","姨妈"}},
                  {"hc",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"hd",{"姻伯父","姻伯母","哥哥","你开心就好","侄子","侄女","姻兄","姻弟","姻姐","姻妹"}},
                  {"he",{"哥哥","嫂子","你开心就好","侄媳","侄孙","侄孙女","侄子","侄子","侄女","侄女"}},
                  {"hf",{"哥哥","嫂子","侄女婿","你开心就好","侄孙","侄孙女","侄子","侄子","侄女","侄女"}},
                  {"hg",{"爸爸","妈妈","呃，怎么叫随你","嫂子","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"hh",{"爸爸","妈妈","呃，怎么叫随你","弟妹","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},
                  {"hi",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"hj",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},

                  {"ia",{"爷爷","奶奶","呃，怎么叫随你","妈妈","自己/哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑妈"}},
                  {"ib",{"外公","外婆","妈妈","哈哈","自己/哥哥/弟弟","自己/姐姐/妹妹","大舅","小舅","大姨","姨妈"}},
                  {"id",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"ic",{"姻世伯","姻世母","你开心就好","姐姐","外甥","外甥女","姻兄","姻弟","姻姐","姻妹"}},
                  {"ie",{"姐夫","姐姐","你开心就好","外甥媳妇","外甥孙","外甥孙女","外甥","外甥","外甥女","外甥女"}},
                  {"if",{"姐夫","姐姐","侄女婿","你开心就好","外甥孙","外甥孙女","外甥","外甥","外甥女","外甥女"}},
                  {"ig",{"爸爸","妈妈","呃，怎么叫随你","嫂子","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"ih",{"爸爸","妈妈","呃，怎么叫随你","弟妹","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},
                  {"ii",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"ij",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},

                  {"ja",{"爷爷","奶奶","呃，怎么叫随你","妈妈","自己/哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑妈"}},
                  {"jb",{"外公","外婆","妈妈","哈哈","自己/哥哥/弟弟","自己/姐姐/妹妹","大舅","小舅","大姨","姨妈"}},
                  {"jd",{"呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你","呃，怎么叫随你"}},
                  {"jc",{"姻世伯","姻世母","你开心就好","姐姐","外甥","外甥女","姻兄","姻弟","姻姐","姻妹"}},
                  {"je",{"姐夫","姐姐","你开心就好","外甥媳妇","外甥孙","外甥孙女","外甥","外甥","外甥女","外甥女"}},
                  {"jf",{"姐夫","姐姐","侄女婿","你开心就好","外甥孙","外甥孙女","外甥","外甥","外甥女","外甥女"}},
                  {"jg",{"爸爸","妈妈","呃，怎么叫随你","嫂子","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"jh",{"爸爸","妈妈","呃，怎么叫随你","弟妹","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}},
                  {"ji",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥","弟弟/自己","姐姐","妹妹/自己"}},
                  {"jj",{"爸爸","妈妈","妹夫/姐夫","开心就好","侄子","侄女","哥哥/自己","弟弟/自己","姐姐/自己","妹妹/自己"}}
                 };
//one step operation
char chu[10][100]={"爸爸","妈妈","丈夫","妻子x","儿子","女儿","哥哥","弟弟","姐姐","妹妹"};
//two step opration
char a[10][100]={"祖父","祖母","是你就好","自己","自己/哥哥/弟弟","自己/姐姐/妹妹","伯伯","叔叔","姑妈","姑姐"};
char b[10][100]={"外公","外婆","爸爸","哈哈","大舅","小舅","自己/哥哥/弟弟","自己/姐姐/妹妹","大姨","姨妈"};
char c[10][100]={"公公","婆婆","呃，暂时还不支持这个功能","呃，暂时还不支持这个功能","儿子","女儿","大伯子","小叔子","大姑子","小姑子"};
char d[10][100]={"岳父","岳母","自己","哈哈","儿子","女儿","大舅哥","小舅子","小姨子","小姨子"};//wife
char e[10][100]={"自己/丈夫","自己/妻子","暂时还不支持这个功能","儿媳妇","孙子","孙女","儿子","儿子","女儿","女儿"};//son
char f[10][100]={"自己/丈夫","自己/妻子","女婿","暂时还不支持这个功能","外孙子","外孙女","儿子","儿子","女儿","女儿"};//dur
char g[10][100]={"爸爸","妈妈","呃，暂时还不支持这个功能","嫂子","侄子","侄女","哥哥","自己/哥哥/弟弟","姐姐","自己/姐姐/妹妹"};
char h[10][100]={"父亲","母亲","呃，暂时还不支持这个功能","弟妹","侄子","侄女","自己/哥哥/弟弟","弟弟","自己/姐姐/妹妹","妹妹"};
char i[10][100]={"父亲","母亲","姐夫","呃，暂时还不支持这个功能","外甥","外甥女","哥哥","自己/哥哥/弟弟","姐姐","自己/姐姐/妹妹"};
char j[10][100]={"父亲","母亲","妹夫","呃，暂时还不支持这个功能","外甥","外甥女","自己/哥哥/弟弟","弟弟","自己/姐姐/妹妹","妹妹"};

#endif // RESOUSE_H
